{
  "users": [
    {
      "email": "mail@correo.com",
      "password": "password",
      "confirmPassword": "password",
      "id": "1"
    }
  ],
  "news": [
    {
      "title": "Probando una imagen alargada a ver que tal que esta interfaz de Windows sería temporal: fue desarrollada en una mañana y lleva 30 años sin cambios",
      "body": "texto largo de la noticia",
      "image": "https://c8.alamy.com/compes/d49eb6/alargadas-nubes-iluminadas-por-el-sol-d49eb6.jpg",
      "date": "27/03/2024",
      "user_id": "12134541",
      "id": "7"
    },
    {
      "title": "Probando una imagen alargada a ver que tal que esta interfaz de Windows sería temporal: fue desarrollada en una mañana y lleva 30 años sin cambios",
      "body": "Estamos a las puertas de un nuevo ‘halving’ de Bitcoin, un evento que ocurre aproximadamente cada cuatro años en el que se reduce a la mitad la recompensa que los participantes de la red reciben por cada bloque minado. Esto puede traducirse en menores beneficios para aquellos que aportan su infraestructura para validar las transacciones de la moneda digital descentralizada más popular del planeta. Si bien casi todos sabemos que hay muchas personas que minan criptomonedas desde su casa, con potentes tarjetas gráficas, también hay compañías enormes que desarrollan este negocio a gran escala. Algunas de ellas incluso manejan balances millonarios y cotizan en bolsa. Pues bien, el ‘halving’ acabará impactando de alguna u otra forma en estas firmas que, por cierto, están tomando acción. Aquellos que se dedican a minar criptomonedas de manera profesional suelen montar enormes granjas de minado con unos equipos conocidos como ASIC. Estos aparatos están diseñados específicamente para minar criptomonedas. Y esto tiene enromes ventajas frente a infraestructuras más artesanales. Tienen una enorme capacidad de cálculo, son fáciles de instalar, gestionan bien el calor y son eficientes. Pero, como ocurre en el mundo del hardware en general, la llegada de nuevas generaciones de ASIC están haciendo que muchos de los dispositivos actualmente en funcionamiento empiecen a quedarse obsoletos. Frente a este escenario, y teniendo en cuenta que el ‘halving’ se aproxima, las compañías que minan criptomonedas a escala han empezado a actualizar su infraestructura. Según recoge Bloomberg, varias firmas estadounidenses necesitan mejorar su eficiencia para reducir el impacto del evento cuatrienal. Esta actualización de hardware, que en muchos casos ya están en marcha, es un enorme negocio para otros actores. Hay compañías que se encargan de revender las máquinas que los mineros profesionales estadounidenses han dejado de utilizar. Como la economía del minado depende mucho del precio de la energía eléctrica, el nuevo destino de estas máquinas obsoletas para el mercado estadounidense son países en los que el coste de la electricidad es notablemente más bajo. Estamos frente a una realidad donde los mineros tratan de exprimir cada céntimo para optimizar sus ganancias, donde cada kilovatio hora consumido cuenta. Una compañía llamada SunnySide Digital está revendiendo ASIC que fueron utilizados en granja estadounidenses en Etiopía, Tanzania, Paraguay y Uruguay. Luxor Technology, otra firma que también está en este negocio, cree que aproximadamente 600.000 equipos de minado se trasladarán desde Estados Unidos a países de África y Sudamérica próximamente a causa del ‘halving’.",
      "image": "https://i.blogs.es/41962e/minado-criptomonedas-2/1200_800.jpeg",
      "date": "27/03/2024",
      "user_id": "12134541",
      "id": "8"
    }
  ]
}